Enums/СостоянияСбораГрафиковОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияСбораГрафиковОтпусков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утверждено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СборГрафиковОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СборГрафиковОтпусков</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СборЗапущен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СборЗавершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСбораГрафиковОтпусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорневойСборГрафиков</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборГрафиковОтпусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаСбор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнициаторСбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСотрудников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СборАннулирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАннулирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаАннулирование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Внешний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСбора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПожеланияСотрудниковВидныТолькоОтветственному</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СборПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКорневойСбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОтпуска</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОтпусков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ПодразделенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПодразделенияОрганизаций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сформировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расформировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасформирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСоответствуетСудамЗарегистрированнымВРоссийскомМеждународномРеестреСудов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочиванияИерархического</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименяемыйЛьготныйТерриториальныйТариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТарифовСтраховыхВзносов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботыСотрудников</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГрафикРаботыСотрудниковПодразделенияОрганизации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмеетНомерТерриториальногоОрганаРосстата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТерриториальногоОрганаРосстата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОрганаФСГС</Name>
					<Comment>Код органа Федеральной службы государственной статистики</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКВЭД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОКВЭД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициентРФ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СамостоятельнаяКлассификационнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СамостоятельныеКлассификационныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляЗаписейОТрудовойДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗависимыеСтажи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСтажа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыСтажа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СборГрафиковОтпусков/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьКоличествоСотрудников");
	Методы.Вставить("ВключитьСборГрафиковОтпусков");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// См. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия          = "3.1.25.129";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура       = "СборГрафиковОтпусков.ВключитьСборГрафиковОтпусков";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия          = "3.1.29.71";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор   = Новый УникальныйИдентификатор("33b1d0ea-c6d2-4421-aed2-bccec215f17e");
	Обработчик.Процедура       = "СборГрафиковОтпусков.ЗаполнитьКоличествоСотрудников";
	Обработчик.Комментарий     = НСтр("ru = 'Заполнение количества сотрудников, запланировавших отпуск'");
	
КонецПроцедуры

// Устанавливает значение для константы ИспользоватьСборГрафиковОтпусков.
//	Параметры:
//		НовоеЗначение - Булево;
Процедура УстановитьЗначениеИспользоватьСборГрафиковОтпусков(НовоеЗначение) Экспорт 
	
	Если НовоеЗначение <> Константы.ИспользоватьСборГрафиковОтпусков.Получить() Тогда
		Константы.ИспользоватьСборГрафиковОтпусков.Установить(НовоеЗначение);
	КонецЕсли;
	
КонецПроцедуры

#Область КабинетСотрудника

// Формирует данные графиков для публикации в сервисе 1С:Кабинет сотрудника.
// 
// Параметры;
// 		МассивОтбора - Массив
//
// Возвращаемое значение:
// 		см. НоваяТаблицаСборыГрафиковОтпусковПредприятияДляСервисаКабинетСотрудника
Функция ДанныеСборовГрафиковОтпусковДляСервисаКабинетСотрудника(МассивОтбора) Экспорт 

	НоваяТаблица = НоваяТаблицаСборыГрафиковОтпусковДляСервисаКабинетСотрудника();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылки", МассивОтбора);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Документы.Ссылка КАК ГрафикСбора,
	|	Документы.Год КАК Год,
	|	Документы.ИнициаторСбора КАК ИнициаторСбора,
	|	Документы.Состояние КАК СостояниеСбораГрафиковОтпусков,
	|	Документы.ИдентификаторДокумента КАК ИдентификаторДокумента,
	|	Документы.СборПоПодразделениям КАК СборПоПодразделениям,
	|	Документы.ДатаОкончанияСбора КАК ДатаОкончанияСбора
	|ИЗ
	|	Документ.СборГрафиковОтпусков КАК Документы
	|ГДЕ
	|	Документы.Ссылка В(&Ссылки)";
	ДанныеГрафиков = Запрос.Выполнить().Выгрузить();
	Настройки = РегистрыСведений.НастройкиСбораГрафиковОтпусковКабинетСотрудника.Настройки();
	
	Для Каждого СтрокаДанных Из ДанныеГрафиков Цикл
		НоваяСтрока = НоваяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
		НоваяСтрока.Настройки = Настройки;
	КонецЦикла;
	
	Возврат НоваяТаблица
	
КонецФункции

// Получает список документов по переданным идентификаторам.
//
// Параметры
// 		Идентификаторы - Массив - идентификаторы
//
// 	Возвращаемое значение
// 		Соответствите - ключ Идентификатор, значение ссылка на документ.
//
Функция ДокументыПоИдентификаторам(Идентификаторы) Экспорт

	ИдентификаторыДокументы = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Идентификаторы", Идентификаторы);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Документы.Ссылка КАК Ссылка,
	|	Документы.ИдентификаторДокумента КАК ИдентификаторДокумента
	|ИЗ
	|	Документ.СборГрафиковОтпусков КАК Документы
	|ГДЕ
	|	Документы.ИдентификаторДокумента В(&Идентификаторы)";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ИдентификаторыДокументы.Вставить(Выборка.ИдентификаторДокумента, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат ИдентификаторыДокументы;

КонецФункции

// Описание документа график подразделения.
// 
// Возвращаемое значение:
//  Структура - Описание документа график подразделения:
// * ГрафикСбора - ДокументСсылка.СборГрафиковОтпусков - 
// * Дата - Дата - 
// * Год - Число -
// * Подразделение - СправочникСсылка.ПодразделенияОрганизаций, СправочникСсылка.СтруктураПредприятия -
// * ОтветственныйЗаСбор - СправочникСсылка.ФизическиеЛица -
// * СостояниеСбораГрафиковОтпусков - ПеречислениеСсылка.СостоянияСбораГрафиковОтпусков -
// * КорневойСборГрафиков - ДокументСсылка.СборГрафиковОтпусков -
// * ИдентификаторДокумента - Строка -
// * Периоды - см. ОписаниеПериодовСотрудников
// * Компенсации - см. ОписаниеКомпенсацийСотрудников
Функция ОписаниеДокументаГрафикПодразделения() Экспорт

	ОписаниеДокумента = Новый Структура("
	|ГрафикСбора,
	|Дата,
	|Год,
	|Подразделение,
	|ОтветственныйЗаСбор,
	|СостояниеСбораГрафиковОтпусков,
	|КорневойСборГрафиков,
	|ПожеланияСотрудниковВидныТолькоОтветственному,
	|ИдентификаторДокумента,
	|Периоды,
	|Компенсации");
	
	ОписаниеДокумента.Периоды = ОписаниеПериодовСотрудников();
	ОписаниеДокумента.Компенсации = ОписаниеКомпенсацийСотрудников();
		
	Возврат ОписаниеДокумента;

КонецФункции

Процедура ОбработатьНовыйГрафикПодразделения(ОписаниеДокумента, ИдентификаторыДокументы) Экспорт
	
	ДокументСсылка = ?(ЗначениеЗаполнено(ОписаниеДокумента.ГрафикСбора), 
		ОписаниеДокумента.ГрафикСбора, 
		ИдентификаторыДокументы[ОписаниеДокумента.ИдентификаторДокумента]);
	
	Если ДокументСсылка = Неопределено Тогда
		ДокументОбъект = НовыйДокументСборГрафиковОтпусковПодразделения(ОписаниеДокумента);
		ЗаписатьДокументСборГрафиковОтпусков(ДокументОбъект, ОписаниеДокумента);
	Иначе
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Документ.СборГрафиковОтпусков");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ДокументСсылка);
			Блокировка.Заблокировать();
			
			ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
			ЗаписатьДокументСборГрафиковОтпусков(ДокументОбъект, ОписаниеДокумента);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение ОписаниеОшибки();
		КонецПопытки;
		
	КонецЕсли;

КонецПроцедуры

// Новая таблица сборы графиков отпусков предприятия для сервиса кабинет сотрудника.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Новая таблица сборы графиков отпусков предприятия для сервиса кабинет сотрудника:
// * ГрафикСбора - ДокументСсылка.СборГрафиковОтпусков - 
// * Год - Число - 
// * ИнициаторСбора - СправочникСсылка.ФизическиеЛица - 
// * СостояниеСбораГрафиковОтпусков - ПеречислениеСсылка.СостоянияСбораГрафиковОтпусков - 
// * ИдентификаторДокумента - Строка - 
// * СборПоПодразделениям - Булево - 
// * ДатаОкончанияСбора - Дата - 
// * Настройки -  
Функция НоваяТаблицаСборыГрафиковОтпусковДляСервисаКабинетСотрудника()

	НоваяТаблица = Новый ТаблицаЗначений;
	НоваяТаблица.Колонки.Добавить("ГрафикСбора", 						Новый ОписаниеТипов("ДокументСсылка.СборГрафиковОтпусков"));
	НоваяТаблица.Колонки.Добавить("Год", 								Новый ОписаниеТипов("Число"));
	НоваяТаблица.Колонки.Добавить("ИнициаторСбора", 					Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	НоваяТаблица.Колонки.Добавить("СостояниеСбораГрафиковОтпусков", 	Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияСбораГрафиковОтпусков"));
	НоваяТаблица.Колонки.Добавить("ИдентификаторДокумента", 			Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("СборПоПодразделениям",				Новый ОписаниеТипов("Булево"));
	НоваяТаблица.Колонки.Добавить("ДатаОкончанияСбора", 				Новый ОписаниеТипов("Дата"));
	НоваяТаблица.Колонки.Добавить("Настройки", 							Новый ОписаниеТипов("Структура"));

	Возврат НоваяТаблица
	
КонецФункции

// Описание периодов сотрудников.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Описание периодов сотрудников:
// * ФизическоеЛицо - СправочникСсылка.ФизическиеЛица - 
// * ДатаНачала - Дата - 
// * ДатаОкончания - Дата - 
// * ИдентификаторСтроки - Строка - 
// * Сотрудник - СправочникСсылка.Сотрудники - 
// * ВидОтпуска - СправочникСсылка.ВидыОтпусков - 
Функция ОписаниеПериодовСотрудников()

	Периоды = Новый ТаблицаЗначений;
	Периоды.Колонки.Добавить("ФизическоеЛицо", 		Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	Периоды.Колонки.Добавить("ДатаНачала", 			Новый ОписаниеТипов("Дата"));
	Периоды.Колонки.Добавить("ДатаОкончания", 		Новый ОписаниеТипов("Дата"));
	Периоды.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка"));
	Периоды.Колонки.Добавить("Сотрудник", 			Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Периоды.Колонки.Добавить("ВидОтпуска", 			Новый ОписаниеТипов("СправочникСсылка.ВидыОтпусков"));
	
	Возврат Периоды
	
КонецФункции

// Описание компенсаций сотрудников.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Описание компенсаций сотрудников:
// * ФизическоеЛицо - СправочникСсылка.ФизическиеЛица - 
// * Год - Число - 
// * ДнейКомпенсации - Число - 
// * ИдентификаторСтроки - Строка - 
// * Сотрудник - СправочникСсылка.Сотрудники - 
// * ВидОтпуска - СправочникСсылка.ВидыОтпусков - 
Функция ОписаниеКомпенсацийСотрудников()

	Компенсации = Новый ТаблицаЗначений;
	Компенсации.Колонки.Добавить("ФизическоеЛицо", 		Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	Компенсации.Колонки.Добавить("Год", 				Новый ОписаниеТипов("Число"));
	Компенсации.Колонки.Добавить("ДнейКомпенсации", 	Новый ОписаниеТипов("Число"));
	Компенсации.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка"));
	Компенсации.Колонки.Добавить("Сотрудник", 			Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Компенсации.Колонки.Добавить("ВидОтпуска", 			Новый ОписаниеТипов("СправочникСсылка.ВидыОтпусков"));

	Возврат Компенсации
	
КонецФункции

// Новая таблица подразделения сбора графиков отпусков.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Новая таблица подразделения сбора графиков отпусков:
// * ГрафикСбора - ДокументСсылка.СборГрафиковОтпусков - 
// * Год - Число -
// * Подразделение - СправочникСсылка.ПодразделенияОрганизаций, СправочникСсылка.СтруктураПредприятия -
// * ОтветственныйЗаСбор - СправочникСсылка.ФизическиеЛица -
// * СостояниеСбораГрафиковОтпусков - ПеречислениеСсылка.СостоянияСбораГрафиковОтпусков -
// * КорневойСборГрафиков - ДокументСсылка.СборГрафиковОтпусков -
// * ИдентификаторДокумента - Строка -
// * Периоды - см. ОписаниеПериодовСотрудников
// * Компенсации - см. ОписаниеКомпенсацийСотрудников
Функция НоваяТаблицаПодразделенияСбораГрафиковОтпусков()

	НоваяТаблица = Новый ТаблицаЗначений;
	НоваяТаблица.Колонки.Добавить("ГрафикСбора", 						Новый ОписаниеТипов("ДокументСсылка.СборГрафиковОтпусков"));
	НоваяТаблица.Колонки.Добавить("Год", 								Новый ОписаниеТипов("Число"));
	НоваяТаблица.Колонки.Добавить("Подразделение", 						Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций, СправочникСсылка.СтруктураПредприятия"));
	НоваяТаблица.Колонки.Добавить("ОтветственныйЗаСбор", 				Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	НоваяТаблица.Колонки.Добавить("СостояниеСбораГрафиковОтпусков",		Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияСбораГрафиковОтпусков"));
	НоваяТаблица.Колонки.Добавить("КорневойСборГрафиков", 				Новый ОписаниеТипов("ДокументСсылка.СборГрафиковОтпусков"));
	НоваяТаблица.Колонки.Добавить("ИдентификаторДокумента", 			Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Периоды", 							Новый ОписаниеТипов("ТаблицаЗначений"));
	НоваяТаблица.Колонки.Добавить("Компенсации", 						Новый ОписаниеТипов("ТаблицаЗначений"));
	НоваяТаблица.Колонки.Добавить("ИдентификаторГрафикаПредприятия", 	Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("ПожеланияСотрудниковВидныТолькоОтветственному", Новый ОписаниеТипов("Булево"));

	Возврат НоваяТаблица
		
КонецФункции

// Данные графиков отпусков подразделений.
// 
// Параметры:
//  Ссылки - Массив из ДокументСсылка.СборГрафиковОтпусков - Список документов
// 
// Возвращаемое значение:
//   см. НоваяТаблицаПодразделенияСбораГрафиковОтпусков
Функция ДанныеГрафиковОтпусковПодразделений(Ссылки) Экспорт 

	ТаблицаПодразделений = НоваяТаблицаПодразделенияСбораГрафиковОтпусков();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылки", Ссылки);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Документы.Ссылка КАК ГрафикСбора,
	|	Документы.Год КАК Год,
	|	Документы.Подразделение КАК Подразделение,
	|	Документы.ОтветственныйЗаСбор КАК ОтветственныйЗаСбор,
	|	Документы.Состояние КАК СостояниеСбораГрафиковОтпусков,
	|	Документы.КорневойСборГрафиков КАК КорневойСборГрафиков,
	|	Документы.ИдентификаторДокумента КАК ИдентификаторДокумента,
	|	Документы.ПожеланияСотрудниковВидныТолькоОтветственному КАК ПожеланияСотрудниковВидныТолькоОтветственному,
	|	КорневыеДокументы.ИдентификаторДокумента КАК ИдентификаторГрафикаПредприятия,
	|	Документы.Сотрудники.(
	|		Сотрудник КАК Сотрудник,
	|		ФизическоеЛицо КАК ФизическоеЛицо,
	|		ДатаНачала КАК ДатаНачала,
	|		ДатаОкончания КАК ДатаОкончания,
	|		КоличествоДней КАК КоличествоДней,
	|		ВидОтпуска КАК ВидОтпуска
	|	) КАК Сотрудники
	|ИЗ
	|	Документ.СборГрафиковОтпусков КАК Документы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СборГрафиковОтпусков КАК КорневыеДокументы
	|		ПО Документы.КорневойСборГрафиков = КорневыеДокументы.Ссылка
	|ГДЕ
	|	Документы.Ссылка В(&Ссылки)";
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаПодразделений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Периоды = Выборка.Сотрудники.Выгрузить();
	КонецЦикла;
	
	Возврат ТаблицаПодразделений

КонецФункции

#КонецОбласти

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "043fcad2-b99b-11ed-b3ec-2c4d54d2b2aa", Метаданные.Документы.СборГрафиковОтпусков);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.СборГрафиковОтпусков, Истина);
	Списки.Вставить(Метаданные.Справочники.СборГрафиковОтпусковПрисоединенныеФайлы, Истина);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных.
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	|Документ.СборГрафиковОтпусков.Чтение.ГруппыФизическихЛиц
	|Документ.СборГрафиковОтпусков.Изменение.ГруппыФизическихЛиц
	|Документ.СборГрафиковОтпусков.Чтение.Подразделения
	|Документ.СборГрафиковОтпусков.Изменение.Подразделения
	|Справочник.СборГрафиковОтпусковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СборГрафиковОтпусковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц";
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет и записывает на основе переданных данных документ СборГрафиковОтпусков.
//	Параметры:
//		ДокументОбъект - документ объект Сбор графиков отпусков;
//		СтруктураОбъекта - Структура - параметры для заполнения и создания документа.
	
Процедура ЗаписатьДокументСборГрафиковОтпусков(ДокументОбъект, СтруктураОбъекта)
	ДокументОбъект.Подразделение = СтруктураОбъекта.Подразделение;
	ДокументОбъект.ОтветственныйЗаСбор = СтруктураОбъекта.ОтветственныйЗаСбор;
	ДокументОбъект.Состояние = СтруктураОбъекта.СостояниеСбораГрафиковОтпусков;

	ТаблицаСотрудников = Новый ТаблицаЗначений;
	ТаблицаСотрудников.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаСотрудников.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	ТаблицаСотрудников.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));

	ДатаАктуальности = ТекущаяДатаСеанса();
	ФизическиеЛица = ОбщегоНазначения.ВыгрузитьКолонку(СтруктураОбъекта.Периоды, "ФизическоеЛицо", Истина);
	ОсновныеСотрудники = КадровыйУчет.ОсновныеСотрудникиИнформационнойБазы(Ложь, ФизическиеЛица, ДатаАктуальности);
		
	Для каждого СтрокаТЗ Из СтруктураОбъекта.Периоды Цикл       
		Сотрудник = ?(ИнтеграцияКабинетСотрудника.ИспользуетсяВерсияDTO("3.2"), СтрокаТЗ.Сотрудник, ОсновныеСотрудники[СтрокаТЗ.ФизическоеЛицо]);			
		Если Не ЗначениеЗаполнено(Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТаблицаСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		НоваяСтрока.Сотрудник = Сотрудник;
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Таблица", ТаблицаСотрудников);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Сотрудник КАК ГрафикРаботы,
	|	Таблица.ДатаНачала КАК НачалоПериода,
	|	Таблица.ДатаОкончания КАК ОкончаниеПериода
	|ПОМЕСТИТЬ ВТПериодыГрафиков
	|ИЗ
	|	&Таблица КАК Таблица";
	Запрос.Выполнить();
	УчетРабочегоВремениРасширенный.СоздатьВТДанныеПроизводственногоКалендаряПоГрафикам(Запрос.МенеджерВременныхТаблиц);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПериодыГрафиков.ГрафикРаботы КАК Сотрудник,
	|	ПериодыГрафиков.НачалоПериода КАК ДатаНачала,
	|	ПериодыГрафиков.ОкончаниеПериода КАК ДатаОкончания,
	|	ДанныеКалендаря.ДнейКалендарныхБезУчетаПраздников КАК ДлительностьИнтервала
	|ИЗ
	|	ВТДанныеПроизводственногоКалендаряПоГрафикам КАК ДанныеКалендаря
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериодыГрафиков КАК ПериодыГрафиков
	|		ПО ДанныеКалендаря.ГрафикРаботы = ПериодыГрафиков.ГрафикРаботы
	|			И ДанныеКалендаря.НачалоПериода = ПериодыГрафиков.НачалоПериода
	|			И ДанныеКалендаря.ОкончаниеПериода = ПериодыГрафиков.ОкончаниеПериода";
	ТаблицаПериодов = Запрос.Выполнить().Выгрузить();
	ТаблицаПериодов.Индексы.Добавить("Сотрудник,ДатаНачала,ДатаОкончания");
	Отбор = Новый Структура("Сотрудник,ДатаНачала,ДатаОкончания");
	
	ДокументОбъект.Сотрудники.Очистить();
	Для Каждого Период Из СтруктураОбъекта.Периоды Цикл
		СтрокаПериод = ДокументОбъект.Сотрудники.Добавить();
		СтрокаПериод.ФизическоеЛицо = Период.ФизическоеЛицо;
		СтрокаПериод.ДатаНачала 	= Период.ДатаНачала;
		СтрокаПериод.ДатаОкончания 	= Период.ДатаОкончания;
		СтрокаПериод.ВидОтпуска 	= Период.ВидОтпуска;   		
		СтрокаПериод.Сотрудник 		= Период.Сотрудник;    
		Если ИнтеграцияКабинетСотрудника.ИспользуетсяВерсияDTO("3.2") Тогда
			СтрокаПериод.Сотрудник 		= Период.Сотрудник;    
		КонецЕсли;
		Сотрудник = ?(ИнтеграцияКабинетСотрудника.ИспользуетсяВерсияDTO("3.2"), Период.Сотрудник, ОсновныеСотрудники[СтрокаТЗ.ФизическоеЛицо]);					
		Если ЗначениеЗаполнено(Сотрудник) Тогда
			ЗаполнитьЗначенияСвойств(Отбор, Период);
			Отбор.Сотрудник = Сотрудник;
			НайденныеСтроки = ТаблицаПериодов.НайтиСтроки(Отбор);
			Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
				СтрокаПериод.КоличествоДней = НайденныеСтроки[0].ДлительностьИнтервала;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ДокументОбъект.ДополнительныеСвойства.Вставить("НеОбновлятьВыгрузку");
	ДокументОбъект.Записать();

КонецПроцедуры

// Формирует на основе переданных данных документ СборГрафиковОтпусков.
//	Параметры:
//		ОписаниеОбъекта - Структура - параметры для заполнения и создания документа. см. ОписаниеДокументаГрафикПодразделения()
//	Возвращаемое значение:
//		ДокументОбъект - Сбор графиков отпусков.
Функция НовыйДокументСборГрафиковОтпусковПодразделения(ОписаниеОбъекта)
	
	ДокументОбъект = Документы.СборГрафиковОтпусков.СоздатьДокумент();
	ДокументОбъект.ДополнительныеСвойства.Вставить("СсылкаНового", Документы.СборГрафиковОтпусков.ПолучитьСсылку());
	ДокументОбъект.Дата 											= ТекущаяДатаСеанса();
	ДокументОбъект.Год 												= ОписаниеОбъекта.Год;
	ДокументОбъект.Подразделение 									= ОписаниеОбъекта.Подразделение;
	ДокументОбъект.Состояние 										= ОписаниеОбъекта.СостояниеСбораГрафиковОтпусков;
	ДокументОбъект.ИдентификаторДокумента 							= ОписаниеОбъекта.ИдентификаторДокумента;
	ДокументОбъект.КорневойСборГрафиков 							= ОписаниеОбъекта.КорневойСборГрафиков; 
	ДокументОбъект.ПожеланияСотрудниковВидныТолькоОтветственному 	= ОписаниеОбъекта.ПожеланияСотрудниковВидныТолькоОтветственному;
	Если Не ЗначениеЗаполнено(ДокументОбъект.КорневойСборГрафиков) Тогда
		ДокументОбъект.КорневойСборГрафиков = ПолучитьКорневойСборГрафиковОтпусков(ОписаниеОбъекта.Год);
		Если Не ЗначениеЗаполнено(ДокументОбъект.КорневойСборГрафиков) Тогда
			ШаблонСообщения = НСтр("ru = 'Не найден корневой сбор графиков отпусков за %1'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ОписаниеОбъекта.Год);
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
	КонецЕсли;
		
	Возврат ДокументОбъект;
	
КонецФункции

// Формирует на основе переданных данных документ СборГрафиковОтпусков.
//	Параметры:
//		Год - Число (4,0) - год, за который происходит сбор графиков, корневого документа.
//	Возвращаемое значение:
//		ДокументСсылка - Сбор графиков отпусков.
Функция ПолучитьКорневойСборГрафиковОтпусков(Год) 

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Год", Год);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументСборГрафиковОтпусков.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СборГрафиковОтпусков КАК ДокументСборГрафиковОтпусков
	|ГДЕ
	|	ДокументСборГрафиковОтпусков.Год = &Год
	|	И (ДокументСборГрафиковОтпусков.КорневойСборГрафиков = ЗНАЧЕНИЕ(Документ.СборГрафиковОтпусков.ПустаяСсылка)
	|			ИЛИ ДокументСборГрафиковОтпусков.КорневойСборГрафиков = НЕОПРЕДЕЛЕНО
	|			ИЛИ ДокументСборГрафиковОтпусков.КорневойСборГрафиков ЕСТЬ NULL)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументСборГрафиковОтпусков.Дата УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.СборГрафиковОтпусков.ПустаяСсылка();	
	
КонецФункции

// Определяет находятся ли подчиненные корневому сбору графиков документы СборГрафиковОтпусков в состоянии Утверждено.
//	Параметры:
//		КорневойСборГрафиковОтпусков - документ объект Сбор графиков отпусков.
//	Возвращаемое значение:
//		Булево.
Функция СборыГрафиковОтпусковПодразделенийУтверждены(КорневойСборГрафиковОтпусков) Экспорт
	
	ПубликоватьСтруктуруЮридическихЛиц = ИнтеграцияУправлениеПерсоналом.ПубликоватьСтруктуруЮридическихЛиц();
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;      
	Если ПубликоватьСтруктуруЮридическихЛиц Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтруктураПредприятия.Ссылка КАК Подразделение,
		|	СтруктураПредприятия.Расформировано КАК Расформировано,
		|	СтруктураПредприятия.ДатаРасформирования КАК ДатаРасформирования
		|ПОМЕСТИТЬ ВТСтруктурныеЕдиницы
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК СтруктураПредприятия";
		
		УстановитьПривилегированныйРежим(Истина);
		Запрос.Выполнить(); 
		УстановитьПривилегированныйРежим(Ложь);
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтруктураПредприятия.Ссылка КАК Подразделение,
		|	ЕСТЬNULL(ПодразделенияОрганизаций.Расформировано, ЛОЖЬ) КАК Расформировано,
		|	ЕСТЬNULL(ПодразделенияОрганизаций.ДатаРасформирования, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРасформирования
		|ПОМЕСТИТЬ ВТСтруктурныеЕдиницы
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|		ПО СтруктураПредприятия.Источник = ПодразделенияОрганизаций.Ссылка";
		
		ПараметрыУточнения = ОрганизационнаяСтруктура.ПараметрыУточненияЗапросаПоСостояниюСтруктурыПредприятия();
		ПараметрыУточнения.ИмяВТ = "ВТСтруктурныеЕдиницы";
		ПараметрыУточнения.ДобавлятьОтбор = Ложь;
		ОрганизационнаяСтруктура.УточнитьЗапросПоСостояниюСтруктурыПредприятия(Запрос, ПараметрыУточнения);
		
		УстановитьПривилегированныйРежим(Истина);
		Запрос.Выполнить(); 
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли; 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументСборГрафиковОтпусков.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СборГрафиковОтпусков КАК ДокументСборГрафиковОтпусков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтруктурныеЕдиницы КАК ВТСтруктурныеЕдиницы
	|		ПО ДокументСборГрафиковОтпусков.Подразделение = ВТСтруктурныеЕдиницы.Подразделение
	|ГДЕ
	|	ДокументСборГрафиковОтпусков.КорневойСборГрафиков = &КорневойСборГрафиков
	|	И (ДокументСборГрафиковОтпусков.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСбораГрафиковОтпусков.Черновик)
	|			ИЛИ ДокументСборГрафиковОтпусков.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСбораГрафиковОтпусков.ВРаботе)
	|			ИЛИ ДокументСборГрафиковОтпусков.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСбораГрафиковОтпусков.ПустаяСсылка))
	|	И (НЕ ВТСтруктурныеЕдиницы.Расформировано
	|			ИЛИ ВТСтруктурныеЕдиницы.ДатаРасформирования > ДокументСборГрафиковОтпусков.Дата
	|				И ГОД(ВТСтруктурныеЕдиницы.ДатаРасформирования) > ДокументСборГрафиковОтпусков.Год)";
	
	Запрос.УстановитьПараметр("КорневойСборГрафиков", КорневойСборГрафиковОтпусков);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#Область ОбновлениеИнформационнойБазы

Процедура ВключитьСборГрафиковОтпусков() Экспорт 
	
	Если Не ИнтеграцияКабинетСотрудникаРасширенный.ДоступноИспользованиеСборГрафиковОтпусков() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьЗначениеИспользоватьСборГрафиковОтпусков(Истина);
	
КонецПроцедуры

Процедура ЗаполнитьКоличествоСотрудников(ПараметрыОбновления = Неопределено) Экспорт 
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	СборГрафиковОтпусков.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТДокументыКОбработке
	|ИЗ
	|	Документ.СборГрафиковОтпусков КАК СборГрафиковОтпусков
	|ГДЕ
	|	СборГрафиковОтпусков.КоличествоСотрудников = 0
	|	И СборГрафиковОтпусков.КорневойСборГрафиков <> ЗНАЧЕНИЕ(Документ.СборГрафиковОтпусков.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СборГрафиковОтпусковСотрудники.Ссылка КАК Ссылка,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СборГрафиковОтпусковСотрудники.ФизическоеЛицо) КАК ЗапланировалоОтпуск
	|ИЗ
	|	Документ.СборГрафиковОтпусков.Сотрудники КАК СборГрафиковОтпусковСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыКОбработке КАК ДокументыКОбработке
	|		ПО СборГрафиковОтпусковСотрудники.Ссылка = ДокументыКОбработке.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СборГрафиковОтпусковСотрудники.Ссылка";
	
	ОписаниеБлокировки = ОбновлениеИБ.ОписаниеБлокируемыхДанных(Метаданные.Документы.СборГрафиковОтпусков);
	
	ОбновляемыеДанные = ОбновлениеИБ.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления);
	
	Если ОбновляемыеДанные.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	Иначе
		ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	КонецЕсли;	
	
	ВыборкаОбновляемыхДанных = ОбновляемыеДанные.Выбрать();
	Пока ВыборкаОбновляемыхДанных.Следующий() Цикл
		
		ОписаниеБлокировки.ПоляБлокировки.Ссылка = ВыборкаОбновляемыхДанных.Ссылка;
		Если Не ОбновлениеИБ.НачатьОбновлениеДанных(ОписаниеБлокировки, ПараметрыОбновления) Тогда
			Продолжить	
		КонецЕсли;
		
		ДокументСборГрафиков = ВыборкаОбновляемыхДанных.Ссылка.ПолучитьОбъект();
		
		ДокументСборГрафиков.КоличествоСотрудников = ВыборкаОбновляемыхДанных.ЗапланировалоОтпуск;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументСборГрафиков);
		ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция СборГрафиковОтпусковПоПодразделениямДоступен() Экспорт
	
	Возврат ИнтеграцияКабинетСотрудника.ИспользуетсяВерсияDTO("3.2");
	
КонецФункции

#КонецОбласти
